In [1]:
import pandas as pd

In [2]:
dict={
    "name": ['yogesh','Neha', 'Kalpana','Prince'],
    "class": ['B.C.A','8th','8th','8th'],
    "School": ['Sanskriti university','Gyaso devi','A.D.P.S','Gyan deep']
}

In [3]:
df=pd.DataFrame(dict)

In [4]:
df

      name  class                School
0   yogesh  B.C.A  Sanskriti university
1     Neha    8th            Gyaso devi
2  Kalpana    8th               A.D.P.S
3   Prince    8th             Gyan deep

In [5]:
df.to_csv('tution.csv')

In [6]:
df.to_csv('tution_index.csv',index=False)

In [7]:
df.head(2)

     name  class                School
0  yogesh  B.C.A  Sanskriti university
1    Neha    8th            Gyaso devi

In [8]:
df.head()

      name  class                School
0   yogesh  B.C.A  Sanskriti university
1     Neha    8th            Gyaso devi
2  Kalpana    8th               A.D.P.S
3   Prince    8th             Gyan deep

In [9]:
df.tail()

      name  class                School
0   yogesh  B.C.A  Sanskriti university
1     Neha    8th            Gyaso devi
2  Kalpana    8th               A.D.P.S
3   Prince    8th             Gyan deep

In [10]:
df.tail(2)

      name class     School
2  Kalpana   8th    A.D.P.S
3   Prince   8th  Gyan deep

In [11]:
df.describe()

          name class                School
count        4     4                     4
unique       4     2                     4
top     yogesh   8th  Sanskriti university
freq         1     3                     1

# reading a csv file

In [13]:
pd.read_csv('tution_index.csv')

      name  class                School
0   yogesh  B.C.A  Sanskriti university
1     Neha    8th            Gyaso devi
2  Kalpana    8th               A.D.P.S
3   Prince    8th             Gyan deep

In [14]:
pd.read_csv('tution.csv')

   Unnamed: 0     name  class                School
0           0   yogesh  B.C.A  Sanskriti university
1           1     Neha    8th            Gyaso devi
2           2  Kalpana    8th               A.D.P.S
3           3   Prince    8th             Gyan deep

In [23]:
df['class'][2]

'9h'

In [24]:
df['class'][0]='8th'
df

      name class                School
0   yogesh   8th  Sanskriti university
1     Neha   8th            Gyaso devi
2  Kalpana    9h               A.D.P.S
3   Prince   8th             Gyan deep

In [28]:
df.index=['first','second','third','fourth']

In [29]:
df

           name class                School
first    yogesh   8th  Sanskriti university
second     Neha   8th            Gyaso devi
third   Kalpana    9h               A.D.P.S
fourth   Prince   8th             Gyan deep